init.org
#+TITLE: Emacs configuration file
#+AUTHOR: Jeff Dwyer

#+STARTUP: hidestars
#+STARTUP: indent
#+BABEL: :cache yes
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+PROPERTY: header-args :tangle yes

* About

This is an Emacs configuration file written in [[http://orgmode.org][Org mode]] based on the original
config by [[https://github.com/larstvei/dot-emacs][larstvei]]. I find organizing the various configurations in an org file
to be easier to maintain than keeping separate files. I'm hoping to
meticulously document my emacs configuration to help both myself and others
that want to use this as a starting point for their own setup. Note that I just
recently adding my settings *on top* of larstvei's so there may still be some
choices that seem contradictory or odd.

If you really do want to try this config out, this is how I'd go about it:

Backup your old =~/.emacs=-file =~/.emacs.d= (if necessary).

#+BEGIN_SRC sh :tangle no
mv ~/.emacs.d ~/.emacs.d-bak
mv ~/.emacs ~/.emacs-bak
#+END_SRC

#+BEGIN_SRC sh :tangle no
git clone https://gitlab.com/JD95/dot-emacs.git
rm -rf ~/.emacs.d
mv ~/dot-emacs ~/.emacs.d
cp ~/.emacs.d/default-settings.el ~/.emacs.d/settings.el
#+END_SRC

On first run it should install a bunch of packages (this might take a
while), and you might have to restart your Emacs the first time. If you
experience bugs, please let me know!

The init.el file essentially exists to replace itself with the contents
of init.org on the initial load. Subsequent updates to the file can be
achieved using =update-init-el= which is defined later.

* Configurations
** Prelude

This settings will help make the rest of the config run smoother.

Lexical scoping is faster than dynamic scoping.

#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t; -*-
(setq lexical-binding t)
#+END_SRC

** Packages

Managing extensions for Emacs is simplified using =package= which is
built in to Emacs 24 and newer. To load downloaded packages we need to
initialize =packenableage=. =cl-lib= is a library that contains many functions from
Common Lisp, and comes in handy quite often, so we want to make sure it's
loaded, along with =package=, which is obviously needed.

#+BEGIN_SRC emacs-lisp
(require 'cl-lib)
#+END_SRC

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
#+end_src

The configuration assumes that the packages listed below are
installed. To ensure we install missing packages if they are missing.

#+BEGIN_SRC emacs-lisp
(eval-when-compile
  (require 'use-package))

; automatically compile Emacs Lisp libraries
(use-package auto-compile
  :ensure t)
; load elisp libraries while Emacs is idle
(use-package idle-require
  :ensure t)
; Try out Emacs packages
(use-package try
  :ensure t)
(use-package which-key
  :ensure t)
(use-package exec-path-from-shell
  :ensure t)
; Modular text completion framework
(use-package company
  :ensure t)
; Emacs support library for PDF files
(use-package pdf-tools
  :ensure t)
; minor mode for editing parentheses
(use-package paredit
  :ensure t)
(use-package focus                ; Dim color of text in surrounding sections
  :ensure t)
; Diminished modes from modeline
(use-package diminish
  :ensure t)
; Increase selected region by semantic units
(use-package expand-region
  :ensure t)
(use-package solarized-theme
  :ensure t)
(use-package define-word          ; display the definition of word at point
  :ensure t)
(use-package avy
  :ensure t)
(use-package smooth-scrolling
  :ensure t)
(use-package git-gutter-fringe
  :ensure t)
(use-package markdown-mode
  :ensure t)
(use-package yaml-mode
  :ensure t)
(use-package auto-compile
  :ensure t)
#+END_SRC

Some packages need to be installed manually, so we add a custom folder to the load path
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'auto-compile)
(auto-compile-on-load-mode)
(auto-compile-on-save-mode)
#+END_SRC

** System
*** macOS

Settings for macOS machines. =exec-path-from-shell= is included to solve
path issues. It to includes environment-variables from the shell, making
using Emacs along with external processes a lot simpler. I also prefer
using the =Command=-key as the =Meta=-key.

#+BEGIN_SRC emacs-lisp
(when (memq window-system '(mac ns))
  (setq select-enable-clipboard t)
  (setq mac-option-key-is-meta nil)
  (setq mac-command-key-is-meta t)
  (setq mac-command-modifier 'meta)
  (setq mac-option-modifier nil)
  (exec-path-from-shell-initialize)
  (grep-compute-defaults)
  (when (fboundp 'mac-auto-operator-composition-mode)
    (mac-auto-operator-composition-mode 1)))
#+END_SRC
*** Linux

Settings specific for linux installs. Like macOS, =exec-path-from-shell= will
be used to resolve environment variables from the shell.

#+BEGIN_SRC emacs-lisp
(when (eq window-system 'gnu/linux)
  (exec-path-from-shell-initialize))
#+END_SRC
*** Windows

#+BEGIN_SRC emacs-lisp
(when (eq window-system 'w32)
  (grep-compute-defaults))
#+END_SRC
*** Require

Some features are not loaded by default to minimize initialization time,
so they have to be required (or loaded, if you will). =require=-calls
tends to lead to the largest bottleneck's in a
configuration. =idle-require= delays the =require=-calls to a time where
Emacs is in idle. So this is great for stuff you eventually want to load,
but is not a high priority.

#+BEGIN_SRC emacs-lisp
   (require 'idle-require)             ; Need in order to use idle-require

   (dolist (feature
            '(auto-compile             ; auto-compile .el files
              ox-latex                 ; the latex-exporter (from org)
              ox-md                    ; Markdown exporter (from org)
              recentf                  ; recently opened files
              tex-mode))               ; TeX, LaTeX, and SliTeX mode commands
     (idle-require feature))

   (setq idle-require-idle-delay 5)
   (idle-require-mode 1)
#+END_SRC
*** Machine Dependent Settings

I pull out any machine specific settings like paths or keys and put them in
a settings file which is not tracked by version control.

#+BEGIN_SRC emacs-lisp
(load-file "~/.emacs.d/settings.el")
#+END_SRC

*** Sane defaults

These are what /I/ consider to be saner defaults.

We can set variables to whatever value we'd like using =setq=.

#+BEGIN_SRC emacs-lisp
(setq auto-revert-interval 1            ; Refresh buffers fast
      custom-file (make-temp-file "")   ; Discard customization's
      default-input-method "TeX"        ; Use TeX when toggling input method
      echo-keystrokes 0.1               ; Show keystrokes asap
      inhibit-startup-message t         ; No splash screen please
      initial-scratch-message nil       ; Clean scratch buffer
      recentf-max-saved-items 100       ; Show more recent files
      ring-bell-function 'ignore        ; Quiet
      sentence-end-double-space nil)    ; No double space
;; Some mac-bindings interfere with Emacs bindings.
(when (boundp 'mac-pass-command-to-system)
  (setq mac-pass-command-to-system nil))
#+END_SRC

Some variables are buffer-local, so changing them using =setq= will only
change them in a single buffer. Using =setq-default= we change the
buffer-local variable's default value.

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil              ; Use spaces instead of tabs
              split-width-threshold 160         ; Split verticly by default
              split-height-threshold nil)       ; Split verticly by default
#+END_SRC

Answering /yes/ and /no/ to each question from Emacs can be tedious, a
single /y/ or /n/ will suffice.

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

To avoid file system clutter we put all auto saved files in a single
directory.

#+BEGIN_SRC emacs-lisp
(defvar emacs-autosave-directory
  (concat user-emacs-directory "autosaves/")
  "This variable dictates where to put auto saves. It is set to a
  directory called autosaves located wherever your .emacs.d/ is
  located.")

;; Sets all files to be backed up and auto saved in a single directory.
(setq backup-directory-alist
      `((".*" . ,emacs-autosave-directory))
      auto-save-file-name-transforms
      `((".*" ,emacs-autosave-directory t)))
#+END_SRC

By default the =narrow-to-region= command is disabled and issues a
warning, because it might confuse new users. I find it useful sometimes,
and don't want to be warned.

#+BEGIN_SRC emacs-lisp
(put 'narrow-to-region 'disabled nil)
#+END_SRC

Automaticly revert =doc-view=-buffers when the file changes on disk.

#+BEGIN_SRC emacs-lisp
(add-hook 'doc-view-mode-hook 'auto-revert-mode)
#+END_SRC

#+begin_src emacs-lisp
(add-hook 'write-file-functions 'delete-trailing-whitespace)
#+end_src

*** Garbage Collection

Run garbage collections when frame is not focused

#+begin_src emacs-lisp
(add-function :after after-focus-change-function
  (defun me/garbage-collect-maybe ()
    (unless (frame-focus-state)
      (garbage-collect))))
#+end_src

