init.el
;;; -*- lexical-binding: t; byte-compile-warnings: (not docstrings); -*-

; automatically compile Emacs Lisp libraries
(use-package auto-compile
  :ensure t)
; load elisp libraries while Emacs is idle
(use-package idle-require
  :ensure t)
; Try out Emacs packages
(use-package try
  :ensure t)
(use-package which-key
  :ensure t)
(use-package exec-path-from-shell
  :ensure t)
; Modular text completion framework
(use-package company
  :ensure t)
; Emacs support library for PDF files
(use-package pdf-tools
  :ensure t)
; minor mode for editing parentheses
(use-package paredit
  :ensure t)
(use-package focus                ; Dim color of text in surrounding sections
  :ensure t)
; Diminished modes from modeline
(use-package diminish
  :ensure t)
; Increase selected region by semantic units
(use-package expand-region
  :ensure t)
(use-package solarized-theme
  :ensure t)
(use-package define-word          ; display the definition of word at point
  :ensure t)
(use-package avy
  :ensure t)
(use-package smooth-scrolling
  :ensure t)
(use-package git-gutter-fringe
  :ensure t)
(use-package markdown-mode
  :ensure t)
(use-package yaml-mode
  :ensure t)
(use-package auto-compile
  :ensure t)

(add-to-list 'load-path "~/.emacs.d/lisp/")

(require 'auto-compile)
(auto-compile-on-load-mode)
(auto-compile-on-save-mode)

(when (memq window-system '(mac ns))
  (defvar select-enable-clipboard t)
  (defvar mac-option-key-is-meta nil)
  (defvar mac-command-key-is-meta t)
  (defvar mac-command-modifier 'meta)
  (defvar mac-option-modifier nil)
  (exec-path-from-shell-initialize)
  (grep-compute-defaults)
  (when (fboundp 'mac-auto-operator-composition-mode)
    (mac-auto-operator-composition-mode 1)))

(when (eq window-system 'gnu/linux)
  (exec-path-from-shell-initialize))

(when (eq window-system 'w32)
  (grep-compute-defaults))

(require 'idle-require)             ; Need in order to use idle-require

(dolist (feature
         '(auto-compile             ; auto-compile .el files
           ox-latex                 ; the latex-exporter (from org)
           ox-md                    ; Markdown exporter (from org)
           recentf                  ; recently opened files
           tex-mode))               ; TeX, LaTeX, and SliTeX mode commands
  (idle-require feature))

(setq idle-require-idle-delay 5)
(idle-require-mode 1)

(load-file "~/.emacs.d/settings.el")

(setq auto-revert-interval 1            ; Refresh buffers fast
      custom-file (make-temp-file "")   ; Discard customization's
      default-input-method "TeX"        ; Use TeX when toggling input method
      echo-keystrokes 0.1               ; Show keystrokes asap
      inhibit-startup-message t         ; No splash screen please
      initial-scratch-message nil       ; Clean scratch buffer
      recentf-max-saved-items 100       ; Show more recent files
      ring-bell-function 'ignore        ; Quiet
      sentence-end-double-space nil)    ; No double space
;; Some mac-bindings interfere with Emacs bindings.
(when (boundp 'mac-pass-command-to-system)
  (setq mac-pass-command-to-system nil))

(setq-default indent-tabs-mode nil              ; Use spaces instead of tabs
              split-width-threshold 160         ; Split verticly by default
              split-height-threshold nil)       ; Split verticly by default

(fset 'yes-or-no-p 'y-or-n-p)

(defvar emacs-autosave-directory
  (concat user-emacs-directory "autosaves/")
  "This variable dictates where to put auto saves. It is set to a
  directory called autosaves located wherever your .emacs.d/ is
  located.")

;; Sets all files to be backed up and auto saved in a single directory.
(setq backup-directory-alist
      `((".*" . ,emacs-autosave-directory))
      auto-save-file-name-transforms
      `((".*" ,emacs-autosave-directory t)))

(put 'narrow-to-region 'disabled nil)

(add-hook 'doc-view-mode-hook 'auto-revert-mode)

(add-hook 'write-file-functions 'delete-trailing-whitespace)

(add-function :after after-focus-change-function
  (defun me/garbage-collect-maybe ()
    (unless (frame-focus-state)
      (garbage-collect))))

(dolist (mode
