init.org
*** Mode Defaults

There are some modes that are enabled by default that I don't find
particularly useful. We create a list of these modes, and disable all of
these.

#+BEGIN_SRC emacs-lisp
(dolist (mode
         '(tool-bar-mode                ; No toolbars, more room for text
           scroll-bar-mode              ; No scroll bars either
           menu-bar-mode                ; No menubar
           blink-cursor-mode))          ; The blinking cursor gets old
  (funcall mode 0))
#+END_SRC

Let's apply the same technique for enabling modes that are disabled by
default.

#+BEGIN_SRC emacs-lisp
(dolist (mode
         '(abbrev-mode                  ; E.g. sopl -> System.out.println
           column-number-mode           ; Show column number in mode line
           delete-selection-mode        ; Replace selected text
           dirtrack-mode                ; directory tracking in *shell*
           global-company-mode          ; Auto-completion everywhere
           global-git-gutter-mode       ; Show changes latest commit
           recentf-mode                 ; Recently opened files
           show-paren-mode              ; Highlight matching parentheses
           smooth-scrolling-mode
           which-key-mode))             ; Available keybindings in popup
  (funcall mode 1))

(auto-fill-mode -1)
(remove-hook 'text-mode-hook #'turn-on-auto-fill)
#+END_SRC
*** Visual

Change the color-theme to =gotham=.

#+BEGIN_SRC emacs-lisp
(use-package color-theme-sanityinc-tomorrow
  :ensure t)

(require 'color-theme-sanityinc-tomorrow)
(if (display-graphic-p)
  (color-theme-sanityinc-tomorrow-night)
  (load-theme 'solarized t))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(cond ((member "DejaVu Sans Mono" (font-family-list))
       (set-face-attribute 'default nil :font "DejaVu Sans Mono")
       (set-frame-font "DejaVu Sans Mono" nil t)))

(use-package unicode-fonts :ensure t)
(unicode-fonts-setup)

;; Use this font if the current font can't render a symbol
(set-fontset-font "fontset-default" 'unicode "DejaVu Sans")
#+END_SRC

Prevent emacs from constantly asking for file encoding when using unicode characters

#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
#+end_src

diminish.el allows you to hide or abbreviate their presence in the
modeline. I rarely look at the modeline to find out what minor-modes are
enabled, so I disable every global minor-mode, and some for lisp editing.

To ensure that the mode is loaded before diminish it, we should use
~with-eval-after-load~. To avoid typing this multiple times a small macro
is provided.

#+BEGIN_SRC emacs-lisp
(defmacro safe-diminish (file mode &optional new-name)
  `(with-eval-after-load ,file
     (diminish ,mode ,new-name)))

(safe-diminish "eldoc" 'eldoc-mode)
(safe-diminish "flyspell" 'flyspell-mode)
(safe-diminish "projectile" 'projectile-mode)
(safe-diminish "paredit" 'paredit-mode "()")
#+END_SRC

git-gutter-fringe gives a great visual indication of where you've made
changes since your last commit. There are several packages that performs
this task; the reason I've ended up with =git-gutter-fringe= is that it
reuses the (already present) fringe, saving a tiny bit of screen-estate.

I smuggled some configurations from [[https://github.com/torenord/.emacs.d/][torenord]], providing a cleaner look.

#+BEGIN_SRC emacs-lisp
(require 'git-gutter-fringe)

(dolist (p '((git-gutter:added    . "#0c0")
             (git-gutter:deleted  . "#c00")
             (git-gutter:modified . "#c0c")))
  (set-face-foreground (car p) (cdr p))
  (set-face-background (car p) (cdr p)))
#+END_SRC

*** PDF Tools

[[PDF Tools]] makes a huge improvement on the built-in [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Document-View.html][doc-view-mode]]; the only
drawback is the =pdf-tools-install= (which has to be executed before the
package can be used) takes a couple of /seconds/ to execute. Instead of
running it at init-time, we'll run it whenever a PDF is opened. Note that
it's only slow on the first run!

#+BEGIN_SRC emacs-lisp
(add-hook 'pdf-tools-enabled-hook 'auto-revert-mode)
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-tools-install))
#+END_SRC

*** Completion

I want a pretty aggressive completion system, hence the no delay settings
and short prefix length.

#+BEGIN_SRC emacs-lisp
(setq company-idle-delay 0
      company-echo-delay 0
      company-dabbrev-downcase nil
      company-minimum-prefix-length 2
      company-selection-wrap-around t
      company-transformers '(company-sort-by-occurrence
                             company-sort-by-backend-importance))
#+END_SRC

*** Browser

Sometimes emacs will be unable to find the browser from the path, so the path to the browser is set from settings.

#+BEGIN_SRC emacs-lisp
(when browser-path
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program browser-path))
#+END_SRC

* Custom Bindings Map

Inspired by [[http://stackoverflow.com/questions/683425/globally-override-key-binding-in-emacs][this StackOverflow post]] I keep a =custom-bindings-map= that
holds all my custom bindings. This map can be activated by toggling a
simple =minor-mode= that does nothing more than activating the map. This
inhibits other =major-modes= to override these bindings. I keep this at
the end of the init-file to make sure that all functions are actually
defined.

#+BEGIN_SRC emacs-lisp
(defvar custom-bindings-map (make-keymap)
  "A keymap for custom bindings.")
#+END_SRC

Defined here to allow bindings throughout the rest of the config

* User Functions

This updates the compiled init.el file with any changes made to this file.

** Advice
#+begin_src emacs-lisp
(defun always-true (&rest _args) 1)

(defun mk-y-or-n-p-always-true (old &rest args)
    (progn
      (advice-add 'y-or-n-p :override #'always-true)
      (let ((result (apply old args)))
        (advice-remove 'y-or-n-p #'always-true)
        result)))
#+end_src

** Buffer Control

#+BEGIN_SRC emacs-lisp
(defun kill-this-buffer-unless-scratch ()
  "Works like `kill-this-buffer' unless the current buffer is the
,*scratch* buffer. In witch case the buffer content is deleted and
the buffer is buried."
  (interactive)
  (if (not (string= (buffer-name) "*scratch*"))
      (kill-this-buffer)
    (delete-region (point-min) (point-max))
    (switch-to-buffer (other-buffer))
    (bury-buffer "*scratch*")))

(define-key custom-bindings-map (kbd "C-x k") 'kill-this-buffer-unless-scratch)
#+END_SRC

These functions provide something close to ~text-scale-mode~, but for every
buffer, including the minibuffer and mode line.

#+BEGIN_SRC emacs-lisp
(lexical-let* ((default (face-attribute 'default :height))
               (size default))

(defun global-scale-default ()
  (interactive)
  (setq size default)
  (global-scale-internal size))

(defun global-scale-up ()
  (interactive)
  (global-scale-internal (cl-incf size 20)))

(defun global-scale-down ()
  (interactive)
  (global-scale-internal (cl-decf size 20)))

(defun global-scale-internal (arg)
  (set-face-attribute 'default (selected-frame) :height arg)
  (set-transient-map
   (let ((map (make-sparse-keymap)))
     (define-key map (kbd "C-=") 'global-scale-up)
     (define-key map (kbd "C-+") 'global-scale-up)
     (define-key map (kbd "C--") 'global-scale-down)
     (define-key map (kbd "C-0") 'global-scale-default) map))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-key custom-bindings-map (kbd "C-c C-0") 'global-scale-default)
(define-key custom-bindings-map (kbd "C-c C-=") 'global-scale-up)
(define-key custom-bindings-map (kbd "C-c C-+") 'global-scale-up)
(define-key custom-bindings-map (kbd "C-c C--") 'global-scale-down)
#+END_SRC

#+begin_src emacs-lisp
(defun modi/revert-all-file-buffers ()
  "Refresh all open file buffers without confirmation.
Buffers in modified (not yet saved) state in emacs will not be reverted. They
will be reverted though if they were modified outside emacs.
Buffers visiting files which do not exist any more or are no longer readable
will be killed."
  (interactive)
  (dolist (buf (buffer-list))
    (let ((filename (buffer-file-name buf)))
      ;; Revert only buffers containing files, which are not modified;
      ;; do not try to revert non-file buffers like *Messages*.
      (when (and filename
                 (not (buffer-modified-p buf)))
        (if (file-readable-p filename)
            ;; If the file exists and is readable, revert the buffer.
            (with-current-buffer buf
              (revert-buffer :ignore-auto :noconfirm :preserve-modes))
          ;; Otherwise, kill the buffer.
          (let (kill-buffer-query-functions) ; No query done when killing buffer
            (kill-buffer buf)
            (message "Killed non-existing/unreadable file buffer: %s" filename))))))
  (message "Finished reverting buffers containing unmodified files."))
#+end_src

** Date and Time

A utility for inserting the current date.

#+BEGIN_SRC emacs-lisp
(defun insert-current-date (&optional omit-day-of-week-p)
   "Insert today's date using the current locale.
  With a prefix argument, the date is inserted without the day of
  the week."
   (interactive "P*")
   (insert (calendar-date-string (calendar-current-date) nil
                                 omit-day-of-week-p)))
#+END_SRC

A utility for inserting the current time

#+BEGIN_SRC emacs-lisp
(defvar current-time-format "%H:%M:%S"
  "Format of date to insert with `insert-current-time' func.
Note the weekly scope of the command's precision.")

(defun insert-current-time ()
  "Insert the current time."
  (interactive)
  (insert (format-time-string current-time-format (current-time))))
#+END_SRC

#+begin_src emacs-lisp
(defun current-date ()
  (calendar-date-string
    (calendar-current-date)
    nil))
#+end_src

#+begin_src emacs-lisp
(defun start-of-week ()
  (calendar-date-string
   (calendar-gregorian-from-absolute
    (calendar-dayname-on-or-before
      0 ; Sunday
      (calendar-absolute-from-gregorian (calendar-current-date))))))
#+end_src
#+begin_src emacs-lisp
(defun current-month ()
  (let ((dt (calendar-current-date)))
    (format "%s %s" (calendar-month-name (nth 0 dt)) (nth 2 dt))))
#+end_src
