init.el
         '(tool-bar-mode                ; No toolbars, more room for text
           scroll-bar-mode              ; No scroll bars either
           menu-bar-mode                ; No menubar
           blink-cursor-mode))          ; The blinking cursor gets old
  (funcall mode 0))

(dolist (mode
         '(abbrev-mode                  ; E.g. sopl -> System.out.println
           column-number-mode           ; Show column number in mode line
           delete-selection-mode        ; Replace selected text
           dirtrack-mode                ; directory tracking in *shell*
           global-company-mode          ; Auto-completion everywhere
           global-git-gutter-mode       ; Show changes latest commit
           recentf-mode                 ; Recently opened files
           show-paren-mode              ; Highlight matching parentheses
           smooth-scrolling-mode
           which-key-mode))             ; Available keybindings in popup
  (funcall mode 1))

(auto-fill-mode -1)
(remove-hook 'text-mode-hook #'turn-on-auto-fill)

(use-package color-theme-sanityinc-tomorrow
  :ensure t)

(require 'color-theme-sanityinc-tomorrow)
(if (display-graphic-p)
  (color-theme-sanityinc-tomorrow-night)
  (load-theme 'solarized t))

(cond ((member "DejaVu Sans Mono" (font-family-list))
       (set-face-attribute 'default nil :font "DejaVu Sans Mono")
       (set-frame-font "DejaVu Sans Mono" nil t)))

(use-package unicode-fonts :ensure t)
;(unicode-fonts-setup)

;; Use this font if the current font can't render a symbol
(set-fontset-font "fontset-default" 'unicode "DejaVu Sans")

(prefer-coding-system 'utf-8)

(defmacro safe-diminish (file mode &optional new-name)
  `(with-eval-after-load ,file
     (diminish ,mode ,new-name)))

(safe-diminish "eldoc" 'eldoc-mode)
(safe-diminish "flyspell" 'flyspell-mode)
(safe-diminish "projectile" 'projectile-mode)
(safe-diminish "paredit" 'paredit-mode "()")

(require 'git-gutter-fringe)

(dolist (p '((git-gutter:added    . "#0c0")
             (git-gutter:deleted  . "#c00")
             (git-gutter:modified . "#c0c")))
  (set-face-foreground (car p) (cdr p))
  (set-face-background (car p) (cdr p)))

(add-hook 'pdf-tools-enabled-hook 'auto-revert-mode)
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-tools-install))

(setq company-idle-delay 0
      company-echo-delay 0
      company-dabbrev-downcase nil
      company-minimum-prefix-length 2
      company-selection-wrap-around t
      company-transformers '(company-sort-by-occurrence
                             company-sort-by-backend-importance))

(when browser-path
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program browser-path))

(defvar custom-bindings-map (make-keymap)
  "A keymap for custom bindings.")

(defun always-true (&rest _args) 1)

(defun mk-y-or-n-p-always-true (old &rest args)
    (progn
      (advice-add 'y-or-n-p :override #'always-true)
      (let ((result (apply old args)))
        (advice-remove 'y-or-n-p #'always-true)
        result)))

(defun kill-this-buffer-unless-scratch ()
  "Works like `kill-this-buffer' unless the current buffer is the
*scratch* buffer. In witch case the buffer content is deleted and
the buffer is buried."
  (interactive)
  (if (not (string= (buffer-name) "*scratch*"))
      (kill-this-buffer)
    (delete-region (point-min) (point-max))
    (switch-to-buffer (other-buffer))
    (bury-buffer "*scratch*")))

(define-key custom-bindings-map (kbd "C-x k") 'kill-this-buffer-unless-scratch)

(defun modi/revert-all-file-buffers ()
  "Refresh all open file buffers without confirmation.
Buffers in modified (not yet saved) state in emacs will not be reverted. They
will be reverted though if they were modified outside emacs.
Buffers visiting files which do not exist any more or are no longer readable
will be killed."
  (interactive)
  (dolist (buf (buffer-list))
    (let ((filename (buffer-file-name buf)))
      ;; Revert only buffers containing files, which are not modified;
      ;; do not try to revert non-file buffers like *Messages*.
      (when (and filename
                 (not (buffer-modified-p buf)))
        (if (file-readable-p filename)
            ;; If the file exists and is readable, revert the buffer.
            (with-current-buffer buf
              (revert-buffer :ignore-auto :noconfirm :preserve-modes))
          ;; Otherwise, kill the buffer.
          (let (kill-buffer-query-functions) ; No query done when killing buffer
            (kill-buffer buf)
            (message "Killed non-existing/unreadable file buffer: %s" filename))))))
  (message "Finished reverting buffers containing unmodified files."))

(defun insert-current-date (&optional omit-day-of-week-p)
   "Insert today's date using the current locale.
  With a prefix argument, the date is inserted without the day of
  the week."
   (interactive "P*")
   (insert (calendar-date-string (calendar-current-date) nil
                                 omit-day-of-week-p)))

(defvar current-time-format "%H:%M:%S"
  "Format of date to insert with `insert-current-time' func.
Note the weekly scope of the command's precision.")

(defun insert-current-time ()
  "Insert the current time."
  (interactive)
  (insert (format-time-string current-time-format (current-time))))

(defun current-date ()
  (calendar-date-string
    (calendar-current-date)
    nil))

(defun start-of-week ()
  (calendar-date-string
   (calendar-gregorian-from-absolute
    (calendar-dayname-on-or-before
      0 ; Sunday
      (calendar-absolute-from-gregorian (calendar-current-date))))))

(defun current-month ()
  (let ((dt (calendar-current-date)))
    (format "%s %s" (calendar-month-name (nth 0 dt)) (nth 2 dt))))
