init.org
** Formulas
#+begin_src emacs-lisp
(defun linear-regression (xs ys)
  (let* ((sum (lambda (items) (seq-reduce #'+ items 0)))
         (avg-y (/ (funcall sum ys) (float (length ys))))
         (avg-x (/ (funcall sum xs) (float (length xs))))
         (prods (funcall sum (zipWith (lambda (x y)
                                        (* (- x avg-x) (- y avg-y)))
                                      xs ys)))
         (sqrds (funcall sum (seq-map (lambda (x) (expt (- x avg-x) 2)) xs))))
    (/ prods (float sqrds))))

(defun single-regressor (points)
  (linear-regression (seq-map-indexed (lambda (_x i) i) points) points))
#+end_src

A [[https://en.wikipedia.org/wiki/Simple_linear_regression][single regressor]] is a linear regression with the fixed y intercept at the origin.

** Lists
#+BEGIN_SRC emacs-lisp
(defun zipWith (f xs ys)
  (if (or (eq xs nil) (eq ys nil))
     '()
    (cons (funcall f (car xs) (car ys)) (zipWith f (cdr xs) (cdr ys)))))
(defun zip (xs ys) (zipWith #'list xs ys))
(defun pairs (xs) (zip xs (cdr xs)))
#+END_SRC
** Searching

Often I want to find other occurrences of a word I'm at, or more
specifically the symbol (or tag) I'm at. The
=isearch-forward-symbol-at-point= in Emacs 24.4 works well for this, but
I don't want to be bothered with the =isearch= interface. Rather jump
quickly between occurrences of a symbol, or if non is found, don't do
anything.

#+BEGIN_SRC emacs-lisp
(defun jump-to-symbol-internal (&optional backwardp)
  "Jumps to the next symbol near the point if such a symbol
exists. If BACKWARDP is non-nil it jumps backward."
  (let* ((point (point))
         (bounds (find-tag-default-bounds))
         (beg (car bounds)) (end (cdr bounds))
         (str (isearch-symbol-regexp (find-tag-default)))
         (search (if backwardp 'search-backward-regexp
                   'search-forward-regexp)))
    (goto-char (if backwardp beg end))
    (funcall search str nil t)
    (cond ((<= beg (point) end) (goto-char point))
          (backwardp (forward-char (- point beg)))
          (t  (backward-char (- end point))))))

(defun jump-to-previous-like-this ()
  "Jumps to the previous occurrence of the symbol at point."
  (interactive)
  (jump-to-symbol-internal t))

(defun jump-to-next-like-this ()
  "Jumps to the next occurrence of the symbol at point."
  (interactive)
  (jump-to-symbol-internal))

(define-key custom-bindings-map (kbd "M-,")   'jump-to-previous-like-this)
(define-key custom-bindings-map (kbd "M-.")   'jump-to-next-like-this)
#+END_SRC

I sometimes regret killing the =*scratch*=-buffer, and have realized I
never want to actually kill it. I just want to get it out of the way, and
clean it up. The function below does just this for the
=*scratch*=-buffer, and works like =kill-this-buffer= for any other
buffer. It removes all buffer content and buries the buffer (this means
making it the least likely candidate for =other-buffer=).

This provides a utility for finding the next non-ascii character.
This is useful when pasting text from websites or word.

#+BEGIN_SRC emacs-lisp
(defun find-first-non-ascii-char ()
  "Find the first non-ascii character from point onwards."
  (interactive)
  (let (point)
    (save-excursion
      (setq point
            (catch 'non-ascii
              (while (not (eobp))
                (or (eq (char-charset (following-char))
                        'ascii)
                    (throw 'non-ascii (point)))
                (forward-char 1)))))
    (if point
        (goto-char point)
      (message "No non-ascii characters."))))
#+END_SRC

** Sorting
#+BEGIN_SRC emacs-lisp
(defun sort-words-in-region (start end)
  "Sort the words in a given region (START and END) and return them as a list."
   (sort (split-string (buffer-substring-no-properties start end)) #'string<))

(defun sort-words-sorted (start end)
  "Sort the words in a given region (START and END) and return them as a string."
  (mapconcat 'identity (sort-words-in-region start end) " "))

;;;###autoload
(defun sort-words (start end)
  "Sort words in region alphabetically.
Then insert them replacing the existing region.
START and END are boundries of the selected region."
  (interactive "r")
  (save-excursion
    (save-restriction
      (narrow-to-region start end)
      (let ((words (sort-words-sorted (point-min) (point-max))))
        (delete-region (point-min) (point-max))
        (goto-char (point-min))
        (insert words)))))
#+END_SRC
** Themes

When interactively changing the theme (using =M-x load-theme=), the
current custom theme is not disabled. This often gives weird-looking
results; we can advice =load-theme= to always disable themes currently
enabled themes.

#+BEGIN_SRC emacs-lisp
(defadvice load-theme
    (before disable-before-load (theme &optional no-confirm no-enable) activate)
  (mapc 'disable-theme custom-enabled-themes))
#+END_SRC

** Updating Config

#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure t
  :config
  (org-babel-do-load-languages
  'org-babel-load-languages
        '((dot . t)
           (emacs-lisp . t)
           (shell . t)))
  (setq org-startup-indented t)
  (org-reload))

(defun update-init-el ()
  (interactive)
  (package-refresh-contents)
  ;; Open the configuration
  (find-file (concat user-emacs-directory "init.org"))
  ;; tangle it
  (org-babel-tangle)
  ;; load it
  (load-file (concat user-emacs-directory "init.el"))
  ;; finally byte-compile it
  (byte-compile-file (concat user-emacs-directory "init.el"))
)
#+END_SRC

** Window Controls

This allows a window to shift from a horizontal split into a vertical split

#+BEGIN_SRC emacs-lisp
(defun toggle-window-split ()
  "Change the window split from horizontal to vertical."
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))

(define-key custom-bindings-map (kbd "C-x |") 'toggle-window-split)
#+END_SRC

Here are some utilities for setting up a workspace. Generally, they
are just present window configs generated from a macro.

#+BEGIN_SRC emacs-lisp
(defun general-workspace ()
 "Set up a general split screen workspace."
 (interactive)
 (delete-other-windows nil)
 (split-window-below nil)
 (split-window-right nil)
 (other-window 1)
 (other-window 1)
 (eshell nil))

 (defun single-window-workspace ()
 "Change to a single window workspace."
 (interactive)
 (delete-other-windows nil))

(defun zettelkasten-workspace ()
  "A workspace for editing the Zettelkasten"
  (interactive)
  (delete-other-windows nil)
  (when (boundp 'zettelkasten-people-path)
    (find-file zettelkasten-people-path))
  (split-window-right 50)
  (other-window 1)
  (when (boundp 'zettelkasten-journal-path)
    (find-file zettelkasten-journal-path))
  (when (get-buffer "*Org Agenda*")
    (split-window-right nil)
    (other-window 1)
    (switch-to-buffer (get-buffer "*Org Agenda*"))))
#+END_SRC

* Minor Modes
** avy

Avy is a tool for jumping to specific words based on their first symbol

#+BEGIN_SRC emacs-lisp
(define-key custom-bindings-map (kbd "M-s") 'avy-goto-word-1)
#+END_SRC
** calendar

Define a function to display week numbers in =calender-mode=. The snippet
is from [[http://www.emacswiki.org/emacs/CalendarWeekNumbers][EmacsWiki]].

#+BEGIN_SRC emacs-lisp
(defun calendar-show-week (arg)
  "Displaying week number in calendar-mode."
  (interactive "P")
  (copy-face font-lock-constant-face 'calendar-iso-week-face)
  (set-face-attribute
   'calendar-iso-week-face nil :height 0.7)
  (setq calendar-intermonth-text
        (and arg
             '(propertize
               (format
                "%2d"
                (car (calendar-iso-from-absolute
                      (calendar-absolute-from-gregorian
                       (list month day year)))))
               'font-lock-face 'calendar-iso-week-face))))
#+END_SRC

Evaluate the =calendar-show-week= function.

#+BEGIN_SRC emacs-lisp
(calendar-show-week t)
#+END_SRC
