init.org
** evil

These are the configurations for evil mode editing.

#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :ensure t)

(global-undo-tree-mode)

(use-package evil
  :ensure t
  :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
  :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-tree))

(use-package evil-collection
  :after evil
  :ensure t
  :config
    (evil-collection-init))
#+END_SRC
** expand-region
#+BEGIN_SRC emacs-lisp
(define-key custom-bindings-map (kbd "C->")  'er/expand-region)
(define-key custom-bindings-map (kbd "C-<")  'er/contract-region)
#+END_SRC
** flyspell

Flyspell offers on-the-fly spell checking. We can enable flyspell for all
text-modes with this snippet.

#+BEGIN_SRC emacs-lisp
(when config-use-flyspell
  (add-hook 'text-mode-hook 'turn-on-flyspell))
#+END_SRC

To use flyspell for programming there is =flyspell-prog-mode=, that only
enables spell checking for comments and strings. We can enable it for all
programming modes using the =prog-mode-hook=.

#+BEGIN_SRC emacs-lisp
(when config-use-flyspell
  (add-hook 'prog-mode-hook 'flyspell-prog-mode))
#+END_SRC

When working with several languages, we should be able to cycle through
the languages we most frequently use. Every buffer should have a separate
cycle of languages, so that cycling in one buffer does not change the
state in a different buffer (this problem occurs if you only have one
global cycle). We can implement this by using a [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Closures.html][closure]].

#+BEGIN_SRC emacs-lisp
(defun cycle-languages ()
  "Changes the ispell dictionary to the first element in
ISPELL-LANGUAGES, and returns an interactive function that cycles
the languages in ISPELL-LANGUAGES when invoked."
  (lexical-let ((ispell-languages '#1=("american" "norsk" . #1#)))
    (ispell-change-dictionary (car ispell-languages))
    (lambda ()
      (interactive)
      ;; Rotates the languages cycle and changes the ispell dictionary.
      (ispell-change-dictionary
       (car (setq ispell-languages (cdr ispell-languages)))))))
#+END_SRC

=flyspell= signals an error if there is no spell-checking tool is
installed. We can advice =turn-on-flyspell= and =flyspell-prog-mode= to
only try to enable =flyspell= if a spell-checking tool is available. Also
we want to enable cycling the languages by typing =C-c l=, so we bind the
function returned from =cycle-languages=.

#+BEGIN_SRC emacs-lisp
(defadvice turn-on-flyspell (before check nil activate)
  "Turns on flyspell only if a spell-checking tool is installed."
  (when (executable-find ispell-program-name)
    (local-set-key (kbd "C-c l") (cycle-languages))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defadvice flyspell-prog-mode (before check nil activate)
  "Turns on flyspell only if a spell-checking tool is installed."
  (when (executable-find ispell-program-name)
    (local-set-key (kbd "C-c l") (cycle-languages))))
#+END_SRC

Some keybindings for ease of use

#+BEGIN_SRC emacs-lisp
(define-key custom-bindings-map (kbd "C-c s") 'ispell-word)
#+END_SRC
** git-gutter
#+BEGIN_SRC emacs-lisp
(use-package git-gutter-fringe
  :ensure t)

(define-key custom-bindings-map (kbd "M-g r") #'git-gutter:update-all-windows)
#+END_SRC
** ivy

#+begin_src emacs-lisp
(use-package ivy
  :ensure t)

(use-package ivy-hydra
  :ensure t)

(global-set-key (kbd "C-s") 'swiper-isearch)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "C-c v") 'ivy-push-view)
(global-set-key (kbd "C-c V") 'ivy-pop-view)
(global-set-key (kbd "C-x b")  #'counsel-switch-buffer)
(global-set-key (kbd "C-x C-b") #'list-buffers)
(global-set-key (kbd "C-x k")  #'kill-buffer*)

(setq ivy-re-builders-alist
      '((swiper-isearch . ivy--regex)
        (counsel-projectile-find-file . ivy--regex)
        (t             . ivy--regex-fuzzy)))
#+end_src

Use Prescient with Ivy. This adds memory to counsel selections, sorting the results based on usage history.

#+begin_src emacs-lisp
(use-package prescient
  :ensure t)
(use-package ivy-prescient
  :ensure t
  :after counsel
  :config
    (ivy-prescient-mode 1)
    (prescient-persist-mode 1))

(setq prescient-history-length 100)
(setq prescient-frequency-decay 0.997)
(setq prescient-frequency-threshold 0.5)
(setq prescient-sort-length-enable t)
#+end_src

There are several methods that can be used to filter prescient results:
- literal: query is a literal sub-strings of the candidate
- initalism: query is initials of the candidate
- prefix: query is beginnings of parts of a candidate
- anchored: parts of query are separated by capital letters, similar to prefix with no spaces
- fuzzy: character of query exist in candidate in right order
- regexp: the query is a regexp, find all matches
#+begin_src emacs-lisp
(setq ivy-prescient-enable-filtering t)
(setq prescient-filter-method '(literal regexp fuzzy))
#+end_src

However, we don't want this behavior on all selections. =ivy-prescient-sort-commands= allows us to specify either only the commands we want to use prescient with or which commands to ignore.

#+begin_src emacs-lisp
(setq ivy-prescient-sort-commands
  '(:not ivy-switch-buffer swiper-isearch))
#+end_src

** hyrda

Allows for the creation of menus.

#+BEGIN_SRC emacs-lisp
(use-package hydra
  :ensure t)
(require 'hydra)
#+END_SRC

*** zoom

This menu allows for zooming in and out of the current buffer.

#+BEGIN_SRC emacs-lisp
(defhydra hydra-zoom nil
"zoom"
  ("k" text-scale-increase "in")
  ("j" text-scale-decrease "out"))

(global-set-key (kbd "<f2>") #'hydra-zoom/body)
#+END_SRC

*** window

#+BEGIN_SRC emacs-lisp
(defhydra hydra-window ()
   "
Movement^^        ^Split^               ^Resize^
---------------------------------------------------
_h_ ←           _v_ertical      _H_ X←
_j_ ↓           _x_ horizontal  _J_ X↓
_k_ ↑           _S_ave          _K_ X↑
_l_ →           _o_nly this     _L_ X→
_d_lt Other
_SPC_ cancel
"
   ("h" windmove-left )
   ("j" windmove-down )
   ("k" windmove-up )
   ("l" windmove-right )
   ("H" evil-window-decrease-width)
   ("J" evil-window-decrease-height)
   ("K" evil-window-increase-height)
   ("L" evil-window-increase-width)
   ("v" (lambda ()
          (interactive)
          (split-window-right)
          (windmove-right))
       )
   ("x" (lambda ()
          (interactive)
          (split-window-below)
          (windmove-down))
       )
   ("S" save-buffer)
   ("d" delete-window)
   ("o" delete-other-windows)
   ("SPC" nil)
   )

(define-key evil-window-map (kbd "C-w") 'hydra-window/body)
#+END_SRC
** magit

#+BEGIN_SRC emacs-lisp
(when config-use-magit
  (use-package magit :ensure t)
  (define-key custom-bindings-map (kbd "C-c m") 'magit-status))
#+END_SRC
** projectile

Use a custom program for projectile's grep

#+BEGIN_SRC emacs-lisp
(setq find-program find-location)
#+END_SRC

Enable projectile mode everywhere.

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t)
(use-package counsel-projectile
  :ensure t)

(require 'projectile)
(projectile-mode 1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
(counsel-projectile-mode)
#+END_SRC
** yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :config
    (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
    (yas-global-mode 1)
)
#+end_src

* Major Modes
** agda

#+begin_src emacs-lisp
(when config-use-agda
(load-file (let ((coding-system-for-read 'utf-8))
    (shell-command-to-string "agda-mode.exe locate")))

(require 'agda-input)
(add-hook 'text-mode-hook (lambda () (set-input-method "Agda")))
(add-hook 'org-mode-hook (lambda () (set-input-method "Agda")))
(agda-input-setup)

(add-hook 'agda2-mode-hook
  (lambda ()
    (interactive)
    (set-face-foreground 'agda2-highlight-datatype-face "dodger blue")
    (set-face-foreground 'agda2-highlight-primitive-type-face "dodger blue")
    (set-face-foreground 'agda2-highlight-primitive-face "dodger blue")
    (set-face-foreground 'agda2-highlight-function-face "dodger blue")
    (set-face-foreground 'agda2-highlight-postulate-face "dodger blue")))
)
#+end_src

** bash
** compilation

I often run ~latexmk -pdf -pvc~ in a compilation buffer, which recompiles
the latex-file whenever it is changed. This often results in annoyingly
large compilation buffers; the following snippet limits the buffer size in
accordance with ~comint-buffer-maximum-size~, which defaults to 1024 lines.

#+BEGIN_SRC emacs-lisp
(add-hook 'compilation-filter-hook 'comint-truncate-buffer)
#+END_SRC
** graphviz
#+begin_src emacs-lisp
(use-package graphviz-dot-mode
  :ensure t
  :config
   (setq graphviz-dot-indent-width 4))
#+end_src
** haskell

=haskell-doc-mode= is similar to =eldoc=, it displays documentation in
the echo area. Haskell has several indentation modes - I prefer using
=haskell-indent=.

#+BEGIN_SRC emacs-lisp :tangle (if config-use-haskell "yes" "no")
(use-package haskell-mode
  :ensure t)

(use-package lsp-mode
  :ensure t
  :hook ((haskell-mode . lsp))
  :commands lsp)
(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode)
(use-package flycheck
  :ensure t)
(setq
  lsp-ui-sideline-enable t
  lsp-fly-check-enable t)

(use-package lsp-haskell
  :ensure t
  :config (setf lsp-haskell-server-path "haskell-language-server-wrapper"))

(setq haskell-stylish-on-save t)
(setq haskell-mode-stylish-haskell-path "ormolu")
#+END_SRC
** html

#+begin_src emacs-lisp
(use-package web-mode
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html\\.twig\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
#+end_src

** idris
#+BEGIN_SRC emacs-lisp :tangle (if config-use-idris "yes" "no")
(use-package idris-mode :ensure t)
(add-to-list 'exec-path idris-location)
#+END_SRC

