init.el

(use-package undo-tree
  :ensure t)

(global-undo-tree-mode)

(use-package evil
  :ensure t
  :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
  :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-tree))

(use-package evil-collection
  :after evil
  :ensure t
  :config
    (evil-collection-init))

(define-key custom-bindings-map (kbd "C->")  'er/expand-region)
(define-key custom-bindings-map (kbd "C-<")  'er/contract-region)

(defun cycle-languages ()
  "Changes the ispell dictionary to the first element in
ISPELL-LANGUAGES, and returns an interactive function that cycles
the languages in ISPELL-LANGUAGES when invoked."
  (lexical-let ((ispell-languages '#1=("american" "norsk" . #1#)))
    (ispell-change-dictionary (car ispell-languages))
    (lambda ()
      (interactive)
      ;; Rotates the languages cycle and changes the ispell dictionary.
      (ispell-change-dictionary
       (car (setq ispell-languages (cdr ispell-languages)))))))

(defadvice turn-on-flyspell (before check nil activate)
  "Turns on flyspell only if a spell-checking tool is installed."
  (when (executable-find ispell-program-name)
    (local-set-key (kbd "C-c l") (cycle-languages))))

(defadvice flyspell-prog-mode (before check nil activate)
  "Turns on flyspell only if a spell-checking tool is installed."
  (when (executable-find ispell-program-name)
    (local-set-key (kbd "C-c l") (cycle-languages))))

(define-key custom-bindings-map (kbd "C-c s") 'ispell-word)

(use-package git-gutter-fringe
  :ensure t)

(define-key custom-bindings-map (kbd "M-g r") #'git-gutter:update-all-windows)

(use-package ivy
  :ensure t
  :config (setq ivy-use-virtual-buffers t
                ivy-use-selectable-prompt t
                enable-recursive-minibuffers t
                ivy-display-style 'fancy
                ivy-count-format "(%d/%d)"
                ivy-wrap t))

(use-package ivy-hydra
  :ensure t)

(global-set-key (kbd "C-s") 'swiper-isearch)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "C-c v") 'ivy-push-view)
(global-set-key (kbd "C-c V") 'ivy-pop-view)
(global-set-key (kbd "C-x b")  #'counsel-switch-buffer)
(global-set-key (kbd "C-x C-b") #'list-buffers)
(global-set-key (kbd "C-x k")  #'kill-buffer*)

(setq ivy-re-builders-alist
      '((swiper-isearch . ivy--regex)
        (counsel-projectile-find-file . ivy--regex)
        (t             . ivy--regex-fuzzy)))

(use-package prescient
  :ensure t)
(use-package ivy-prescient
  :ensure t
  :after counsel
  :config
    (ivy-prescient-mode 1)
    (prescient-persist-mode 1))

(setq prescient-history-length 100)
(setq prescient-frequency-decay 0.997)
(setq prescient-frequency-threshold 0.5)
(setq prescient-sort-length-enable t)

(setq ivy-prescient-enable-filtering t)
(setq prescient-filter-method '(literal regexp fuzzy))

(setq ivy-prescient-sort-commands
  '(:not ivy-switch-buffer swiper-isearch))

(use-package hydra
  :ensure t)
(require 'hydra)

(defhydra hydra-zoom nil
"zoom"
  ("k" text-scale-increase "in")
  ("j" text-scale-decrease "out"))

(global-set-key (kbd "<f2>") #'hydra-zoom/body)

(defhydra hydra-window ()
   "
Movement^^        ^Split^               ^Resize^
---------------------------------------------------
_h_ ←           _v_ertical      _H_ X←
_j_ ↓           _x_ horizontal  _J_ X↓
_k_ ↑           _S_ave          _K_ X↑
_l_ →           _o_nly this     _L_ X→
_d_lt Other
_SPC_ cancel
"
   ("h" windmove-left )
   ("j" windmove-down )
   ("k" windmove-up )
   ("l" windmove-right )
   ("H" evil-window-decrease-width)
   ("J" evil-window-decrease-height)
   ("K" evil-window-increase-height)
   ("L" evil-window-increase-width)
   ("v" (lambda ()
          (interactive)
          (split-window-right)
          (windmove-right))
       )
   ("x" (lambda ()
          (interactive)
          (split-window-below)
          (windmove-down))
       )
   ("S" save-buffer)
   ("d" delete-window)
   ("o" delete-other-windows)
   ("SPC" nil)
   )

(define-key evil-window-map (kbd "C-w") 'hydra-window/body)

(use-package magit :ensure t)
(define-key custom-bindings-map (kbd "C-c m") 'magit-status)

(setq find-program find-location)

(use-package projectile
  :ensure t)
(use-package counsel-projectile
  :ensure t)

(require 'projectile)
(projectile-mode 1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
(counsel-projectile-mode)

(use-package yasnippet
  :ensure t
  :config
    (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
    (yas-global-mode 1)
)

(use-package lsp-mode
  :ensure t
  :hook ((haskell-mode . lsp) (dhall-mode .lsp))
  :commands lsp)
(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode)
(use-package flycheck
  :ensure t)
(setq
  lsp-ui-sideline-enable t
  lsp-fly-check-enable t)
(use-package lsp-haskell
  :ensure t
  :config (setf lsp-haskell-server-path "haskell-language-server-wrapper"))

(add-hook 'compilation-filter-hook 'comint-truncate-buffer)

(use-package graphviz-dot-mode
  :ensure t
  :config
   (setq graphviz-dot-indent-width 4))

(use-package haskell-mode
  :ensure t)

(setq haskell-stylish-on-save t)
(setq haskell-mode-stylish-haskell-path "ormolu")

(use-package dhall-mode
  :ensure t
  :config
   (setq
     dhall-format-arguments (\` ("--ascii"))
     dhall-use-header-line nil))

(use-package web-mode
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html\\.twig\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
