init.org
** lisp

#+BEGIN_SRC emacs-lisp
(use-package elmacro
  :ensure t)
(use-package lispy
  :ensure t)
(use-package evil-lispy
  :ensure t)
#+END_SRC

I use =Paredit= when editing lisp code, we enable this for all lisp-modes.

#+BEGIN_SRC emacs-lisp
(dolist (mode '(ielm-mode
                lisp-mode
                emacs-lisp-mode
                lisp-interaction-mode
                scheme-mode))
  ;; add paredit-mode to all mode-hooks
  (add-hook (intern (concat (symbol-name mode) "-hook")) 'paredit-mode))
#+END_SRC

*** Emacs Lisp

In =emacs-lisp-mode= we can enable =eldoc-mode= to display information
about a function or a variable in the echo area.

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
#+END_SRC

This advice makes =eval-last-sexp= (bound to =C-x C-e=) replace the sexp with the value.

#+BEGIN_SRC emacs-lisp
(defadvice eval-last-sexp (around replace-sexp (arg) activate)
  "Replace sexp when called with a prefix argument."
  (if arg
      (let ((pos (point)))
        ad-do-it
        (goto-char pos)
        (backward-kill-sexp)
        (forward-sexp))
    ad-do-it))
#+END_SRC

** lua

#+begin_src emacs-lisp
(use-package lua-mode
  :ensure t)
#+end_src
** markdown

This makes =.md=-files open in =markdown-mode=.

#+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC

I sometimes use a specialized markdown format, where inline math-blocks
can be achieved by surrounding a LaTeX formula with =$math$= and
=$/math$=. Writing these out became tedious, so I wrote a small function.

#+BEGIN_SRC emacs-lisp
   (defun insert-markdown-inline-math-block ()
     "Inserts an empty math-block if no region is active, otherwise wrap a
   math-block around the region."
     (interactive)
     (let* ((beg (region-beginning))
            (end (region-end))
            (body (if (region-active-p) (buffer-substring beg end) "")))
       (when (region-active-p)
         (delete-region beg end))
       (insert (concat "$math$ " body " $/math$"))
       (search-backward " $/math$")))
#+END_SRC

Most of my writing in this markup is in Norwegian, so the dictionary is
set accordingly. The markup is also sensitive to line breaks, so
=auto-fill-mode= is disabled. Of course we want to bind our lovely
function to a key!

#+BEGIN_SRC emacs-lisp
   (add-hook 'markdown-mode-hook
             (lambda ()
               (auto-fill-mode 0)
               (visual-line-mode 1)
               (local-set-key (kbd "C-c b") 'insert-markdown-inline-math-block)) t)
#+END_SRC
** org

Org itself installed earlier

#+BEGIN_SRC emacs-lisp

(use-package ox-twbs
  :ensure t)
(use-package evil-org
  :ensure t)
(use-package org-ql
  :ensure t)
(use-package org-recur
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))
  :demand t
  :config
    (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
    (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
    (setq org-recur-finish-done t
          org-recur-finish-archive t))

(setq org-modules '(org-habit))
#+END_SRC

*** editing

Use aspell if present, mainly useful on windows.

#+BEGIN_SRC emacs-lisp
(cond
 ((executable-find "aspell")
  (setq ispell-program-name "aspell")
  ;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
  (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US"))
 )
)
#+END_SRC

Shortens url links in org mode

#+BEGIN_SRC emacs-lisp
(defun compress-org-link (arg)
  (interactive "P")
  (let ((url (thing-at-point 'url))
    (bounds (bounds-of-thing-at-point 'url)))
    (kill-region (car bounds) (cdr bounds))
    (insert (format "[[%s][%s]]" url
      (truncate-string-to-width url
         (if arg
           (prefix-numeric-value arg)
           40)
       nil nil "...")))))
#+END_SRC

Customizes the structure templates

#+BEGIN_SRC emacs-lisp
(setq org-structure-template-alist
  '(("a" . "export ascii")
    ("c" . "center")
    ("C" . "comment")
    ("e" . "example")
    ("E" . "export")
    ("h" . "export html")
    ("l" . "export latex")
    ("q" . "quote")
    ("s" . "src")
    ("v" . "verse")))
#+END_SRC

Prevents editing invisible text

#+begin_src emacs-lisp
(setq org-fold-catch-invisible-edits 'error)
(setq org-src-preserve-indentation nil)
(setq org-edit-src-content-indentation 0)
#+end_src

This converts markdown style links into org-mode style links

#+begin_src emacs-lisp
(defun org-convert-markdown-links-to-org ()
  (interactive)
  (query-replace-regexp "\\[\\(.+\\)\\](\\(.*\\))" "[[\\2][\\1]]" nil (region-beginning) (region-end)))
#+end_src

This function helps with adding books to my index

#+begin_src emacs-lisp
(defun org-replace-file-path-with-todo-link (start end)
  (interactive "r")
  (query-replace-regexp
   (rx (0+ any)
       (or (: (= 2 (in digit)) ":" (= 2 (in digit)))
           (: (= 4 (in digit)) "-" (= 2 (in digit)) "-" (= 2 (in digit))))
           (1+ " ")
           (: (group (0+ any)) "." (group (or "pdf" "epub" "djvu"))))
   "** READY [[file:./\\1.\\2][\\1]]"
   nil start end))
#+end_src

*** evil org

#+BEGIN_SRC emacs-lisp
(require 'evil-org)
(add-hook 'org-mode-hook 'evil-org-mode)
(add-hook 'org-mode-hook 'visual-line-mode)
(evil-org-set-key-theme '(navigation insert textobjects additional))
#+END_SRC
*** tags

For when a parent heading needs to be broken up into it's children.
Adds any inherited tags to the immediate children.
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (advice-add 'org-set-tags-command :override #'counsel-org-tag))

(defun org-apply-tags-to-children ()
  (interactive)
  (save-excursion
    (org-back-to-heading t)
    (let* ((depth (+ 1 (org-current-level))))
      (org-map-entries
       (lambda ()
         (when (<= (org-current-level) depth)
           (org-set-tags (org-get-tags))))
       nil
       'tree))))
#+end_src

*** file associations

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
#+END_SRC
*** agenda

#+begin_src emacs-lisp
(setq org-agenda-custom-commands
  '(("!" "Expired Deadlines" tags-todo
     "+DEADLINE<\"<today>\"/TODO|PROGRESSING"
     nil nil)
    ("d" "Scheduled or Deadline" agenda
     "+DEADLINE+SCHEDULED"
     nil nil)
    ("u" "Upcoming Events"
     ((org-ql-block '(and (ts :from today :to +62) (tags "Event")))))))
#+end_src

Highlight the current line in agenda view

#+begin_src emacs-lisp
(add-hook 'org-agenda-finalize-hook #'hl-line-mode)
#+end_src

**** schedule

Don't delay for scheduled tasks

#+BEGIN_SRC emacs-lisp
(setq org-scheduled-delay-days 0)
#+END_SRC

Hide all tags on agenda view
#+BEGIN_SRC emacs-lisp
(setq org-agenda-hide-tags-regexp ".*")
#+END_SRC

**** habits

#+BEGIN_SRC emacs-lisp
(require 'org-habit)
(set-face-attribute 'org-habit-overdue-face nil :foreground "gray5" :background "#D84747")
(set-face-attribute 'org-habit-overdue-future-face nil :foreground "gray5" :background "#D84747")
(set-face-attribute 'org-habit-alert-face nil :foreground "gray5" :background "#FFE438")
(set-face-attribute 'org-habit-alert-future-face nil :foreground "gray5" :background "#FFE438")
(set-face-attribute 'org-habit-ready-face nil :foreground "gray5" :background "#53C65F")
(set-face-attribute 'org-habit-ready-future-face nil :foreground "gray5" :background "#53C65F")
(set-face-attribute 'org-habit-clear-face nil :foreground "gray5" :background "#20A4F3")
(set-face-attribute 'org-habit-clear-future-face nil :foreground "gray5" :background "#20A4F3")
(setq org-habit-today-glyph (make-glyph-code ?!))
(setq org-habit-completed-glyph (make-glyph-code ?*))
(setq org-habit-graph-column 45)
(setq org-habit-preceding-days 14)
(setq org-habit-following-days 3)
#+END_SRC

