init.el

(use-package elmacro
  :ensure t)
(use-package lispy
  :ensure t)
(use-package evil-lispy
  :ensure t)

(dolist (mode '(ielm-mode
                lisp-mode
                emacs-lisp-mode
                lisp-interaction-mode
                scheme-mode))
  ;; add paredit-mode to all mode-hooks
  (add-hook (intern (concat (symbol-name mode) "-hook")) 'paredit-mode))

(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)

(defadvice eval-last-sexp (around replace-sexp (arg) activate)
  "Replace sexp when called with a prefix argument."
  (if arg
      (let ((pos (point)))
        ad-do-it
        (goto-char pos)
        (backward-kill-sexp)
        (forward-sexp))
    ad-do-it))

(use-package lua-mode
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))

(defun insert-markdown-inline-math-block ()
  "Inserts an empty math-block if no region is active, otherwise wrap a
math-block around the region."
  (interactive)
  (let* ((beg (region-beginning))
         (end (region-end))
         (body (if (region-active-p) (buffer-substring beg end) "")))
    (when (region-active-p)
      (delete-region beg end))
    (insert (concat "$math$ " body " $/math$"))
    (search-backward " $/math$")))

(add-hook 'markdown-mode-hook
          (lambda ()
            (auto-fill-mode 0)
            (visual-line-mode 1)
            (local-set-key (kbd "C-c b") 'insert-markdown-inline-math-block)) t)

(use-package ox-twbs
  :ensure t)
(use-package evil-org
  :ensure t)
(use-package org-ql
  :ensure t)
(use-package org-recur
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))
  :demand t
  :config
    (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
    (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
    (setq org-recur-finish-done t
          org-recur-finish-archive t))

(setq org-modules '(org-habit))

(cond
 ((executable-find "aspell")
  (setq ispell-program-name "aspell")
  ;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
  (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US"))
 )
)

(defun compress-org-link (arg)
  (interactive "P")
  (let ((url (thing-at-point 'url))
    (bounds (bounds-of-thing-at-point 'url)))
    (kill-region (car bounds) (cdr bounds))
    (insert (format "[[%s][%s]]" url
      (truncate-string-to-width url
         (if arg
           (prefix-numeric-value arg)
           40)
       nil nil "...")))))

(setq org-structure-template-alist
  '(("a" . "export ascii")
    ("c" . "center")
    ("C" . "comment")
    ("e" . "example")
    ("E" . "export")
    ("h" . "export html")
    ("l" . "export latex")
    ("q" . "quote")
    ("s" . "src")
    ("v" . "verse")))

(setq org-fold-catch-invisible-edits 'error)
(setq org-src-preserve-indentation nil)
(setq org-edit-src-content-indentation 0)

(defun org-convert-markdown-links-to-org ()
  (interactive)
  (query-replace-regexp "\\[\\(.+\\)\\](\\(.*\\))" "[[\\2][\\1]]" nil (region-beginning) (region-end)))

(defun org-replace-file-path-with-todo-link (start end)
  (interactive "r")
  (query-replace-regexp
   (rx (0+ any)
       (or (: (= 2 (in digit)) ":" (= 2 (in digit)))
           (: (= 4 (in digit)) "-" (= 2 (in digit)) "-" (= 2 (in digit))))
           (1+ " ")
           (: (group (0+ any)) "." (group (or "pdf" "epub" "djvu"))))
   "** READY [[file:./\\1.\\2][\\1]]"
   nil start end))

(require 'evil-org)
(add-hook 'org-mode-hook 'evil-org-mode)
(add-hook 'org-mode-hook 'visual-line-mode)
(evil-org-set-key-theme '(navigation insert textobjects additional))

(with-eval-after-load 'org
  (advice-add 'org-set-tags-command :override #'counsel-org-tag))

(defun org-apply-tags-to-children ()
  (interactive)
  (save-excursion
    (org-back-to-heading t)
    (let* ((depth (+ 1 (org-current-level))))
      (org-map-entries
       (lambda ()
         (when (<= (org-current-level) depth)
           (org-set-tags (org-get-tags))))
       nil
       'tree))))

(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

(setq org-agenda-custom-commands
  '(("!" "Expired Deadlines" tags-todo
     "+DEADLINE<\"<today>\"/TODO|PROGRESSING"
     nil nil)
    ("d" "Scheduled or Deadline" agenda
     "+DEADLINE+SCHEDULED"
     nil nil)
    ("u" "Upcoming Events"
     ((org-ql-block '(and (ts :from today :to +62) (tags "Event")))))))

(add-hook 'org-agenda-finalize-hook #'hl-line-mode)

(setq org-scheduled-delay-days 0)

(setq org-agenda-hide-tags-regexp ".*")

(require 'org-habit)
(set-face-attribute 'org-habit-overdue-face nil :foreground "gray5" :background "#D84747")
(set-face-attribute 'org-habit-overdue-future-face nil :foreground "gray5" :background "#D84747")
(set-face-attribute 'org-habit-alert-face nil :foreground "gray5" :background "#FFE438")
(set-face-attribute 'org-habit-alert-future-face nil :foreground "gray5" :background "#FFE438")
(set-face-attribute 'org-habit-ready-face nil :foreground "gray5" :background "#53C65F")
(set-face-attribute 'org-habit-ready-future-face nil :foreground "gray5" :background "#53C65F")
(set-face-attribute 'org-habit-clear-face nil :foreground "gray5" :background "#20A4F3")
(set-face-attribute 'org-habit-clear-future-face nil :foreground "gray5" :background "#20A4F3")
(setq org-habit-today-glyph (make-glyph-code ?!))
(setq org-habit-completed-glyph (make-glyph-code ?*))
(setq org-habit-graph-column 45)
(setq org-habit-preceding-days 14)
(setq org-habit-following-days 3)
