init.org
**** todo states

Edna is a package that adds extensible conditions and dependencies for todo states.

#+begin_src emacs-lisp
(use-package org-edna
  :ensure t)

(require 'org-edna)
(org-edna-mode)
#+end_src


#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
  '(("TODO" . (:foreground "red"))
    ("DEVELOPING" . (:foreground "DarkRed"))
    ("PROGRESSING" . (:foreground "orange"))
    ("RESEARCHING" . (:foreground "orange"))
    ("UNVERIFIED" . (:foreground "indian red"))
    ("HOLD" . (:foreground "yellow"))
    ("FAILED" . (:foreground "grey"))
    ("CANCELED" . (:foreground "grey"))
    ("VERIFIED" . (:foreground "green"))
    ("ANSWERED" . (:foreground "green"))))

(setq org-todo-keywords
  '((sequence "TODO(t)" "|" "DONE(d)")
    (sequence "DEVELOPING(v)" "READY(y)" "PROGRESSING(p)" "HOLD(h)" "|" "FINISHED(f)")
    (sequence "UNKNOWN(u)" "RESEARCHING(r)" "|" "ANSWERED(a)")
    (sequence "|" "FAILED(f)" "CANCELED(c)")))
#+END_SRC

Sets priority color faces

#+BEGIN_SRC emacs-lisp
(setq org-priority-faces
  '((?A . (:foreground "#fc0303"))
    (?B . (:foreground "#db792e"))
    (?C . (:foreground "#ebe06a"))
    (?D . (:foreground "#56fc6c"))
    (?E . (:foreground "#00fbff"))
    (?F . (:foreground "#ad61ff"))))

(setq org-priority-highest ?A)
(setq org-priority-lowest ?Z)
(setq org-priority-default ?Z)
(setq org-log-into-drawer 'LOGBOOK)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer 'LOGBOOK)
(setq org-todo-heirarchical-statistics nil)
#+END_SRC

Auto detect what kind of todo item is being completed and call the right function

#+begin_src emacs-lisp
(defun detect-org-recur-advice (orig &rest all)
  (interactive)
  (let ((header-text (nth 4 (org-heading-components))))
    (if (seq-contains-p header-text ?|)
      (progn
        (org-recur-finish)
        (read-char "Task completed! Press any key to continue...") nil 1)
      (apply orig all))))

(advice-add
 #'org-todo :around
 #'detect-org-recur-advice)

(setq org-log-done 'time)
#+end_src

**** todo editing

These functions helps clear out done tasks in an org file

#+BEGIN_SRC emacs-lisp
(defun org-map-tasks (action state)
  (org-map-entries
    (lambda ()
      (funcall action)
      (setq org-map-continue-from (outline-previous-heading)))
    state 'file))

(defun org-archive-done-tasks ()
  (interactive)
  (org-map-tasks 'org-archive-subtree "/DONE"))

(defun org-cut-done-tasks ()
  (interactive)
  (org-map-tasks 'org-cut-subtree "/DONE"))
#+END_SRC

Generates a sequence of todo items based on a sequence of numbers

#+BEGIN_SRC emacs-lisp
(defun org-todo-sequence ()
  "Creates a list of todo items ending with numbers from start to end"
  (interactive)
  (let* ((item (read-string "todo item: "))
         (start (string-to-number (read-string "start index: ")))
         (end (string-to-number (read-string "end index: ")))
         (todo-item (concat "* TODO " item))
         (line-item (lambda (i) (concat todo-item " " (number-to-string i) "\n")))
         (items (mapcar line-item (number-sequence start end))))
    (mapc 'insert items)))
#+END_SRC

Helps sort sections

#+BEGIN_SRC emacs-lisp
(defun org-sort-alpha-todo ()
  (interactive)
  (org-sort-entries nil ?a)
  (org-sort-entries nil ?p)
  (org-sort-entries nil ?o))
#+END_SRC

Count only the subtasks directly beneath a header

#+begin_src emacs-lisp
(setq org-hierarchical-todo-statistics nil)
#+end_src

Sets all immediate children of header to set deadline for sibling 1 day after completion
#+begin_src emacs-lisp
(defun org-set-daily-subtask-deadline ()
  (interactive)
  (save-excursion
    (org-back-to-heading t)
    (let* ((depth (+ 1 (org-current-level))))
      (org-map-entries
       (lambda ()
         (when (<= (org-current-level) depth)
           (org-set-property "TRIGGER" "next-sibling deadline!(\"++1d\")")))
       nil
       'tree))))
#+end_src

***** custom edna triggers

These org-edna functions change only the time on a schedule or deadline.

#+begin_src emacs-lisp
(defun org-edna-set-time (type _last-entry args)
  (let* ((new-time (nth 0 args))
         (prev-ts (org-edna--get-planning-info type))
         (time-val (split-string new-time ":"))
         (ts (org-read-date-analyze prev-ts nil '(nil nil nil nil nil nil))))
    (setcar (nthcdr 2 ts) (string-to-number (nth 0 time-val)))
    (setcar (nthcdr 1 ts) (string-to-number (nth 1 time-val)))
    (org--deadline-or-schedule nil type
       (format-time-string "%F %R" (apply 'encode-time (mapcar (lambda (e) (or e 0)) ts))))))

(defun org-edna-action/schedule-time! (last-entry &rest args)
  (org-edna-set-time 'scheduled last-entry args))

(defun org-edna-action/deadline-time! (last-entry &rest args)
  (org-edna-set-time 'deadline last-entry args))
#+end_src

#+begin_src emacs-lisp
(defun org-edna-action/away-from-home! (last-entry &rest args)
    ())
#+end_src

**** todo navigation

This function will help randomly select a todo in the current tree.

#+BEGIN_SRC emacs-lisp
(defun org-goto-random-subtree (todo-pred &optional depth)
  (interactive)
  (org-back-to-heading t)
  (let ((todos '())
        (top-level (org-current-level)))
    ;; Gather todo headings
    (org-map-tree
     (lambda () (when (and
                  (if depth
                      (<= (org-current-level) (+ top-level depth))
                      t)
                  (funcall todo-pred))
             (setq todos (cons (point) todos)))))
    ;; Randomly select one
    (goto-char
     (nth (random (- (length todos) 1)) todos)))
)

(defun at-todo (exclude-states)
  (and (org-get-todo-state)
       (member (org-get-todo-state) exclude-states)))

(defun org-goto-random-subtree-todo ()
  (interactive)
  (org-goto-random-subtree
   (lambda () (at-todo '("TODO" "DEVELOPING" "PROGRESSING")))))

(defun org-goto-random-subtree-todo-below ()
  (interactive)
  (org-goto-random-subtree
    (lambda () (at-todo '("TODO" "DEVELOPING" "PROGRESSING")))
    1))
#+END_SRC
**** stats

#+begin_src emacs-lisp
(defun force-double-digit-format-advice (orig fmt &rest args)
  (if (string= fmt "[%d%%]")
      (apply #'format "[%02d%%]" args)
      (apply orig fmt args)))

(defun org-update-parent-todo-statistics-advice (orig &rest all)
  (progn
    (advice-add
      #'format :around
      #'force-double-digit-format-advice)
    (apply orig all)
    (advice-remove
      #'format
      #'force-double-digit-format-advice)))

(advice-add
  #'org-update-parent-todo-statistics :around
  #'org-update-parent-todo-statistics-advice)
#+end_src
**** super

#+begin_src emacs-lisp
(use-package org-super-agenda
  :ensure t)

(defun my-org-agenda-remove-recur (str)
  (nth 0 (split-string str "|")))

(setq org-super-agenda-groups '(
  (:name "Time Sensitive"
     :time-grid t
     :tag "TimeSensitive"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Objectives"
     :tag "Objective")
  (:name "Meals"
     :tag "Meal")
  (:name "Shower"
     :tag "Shower"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Short Term Wellfare"
     :priority "A"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Long Term Wellfare"
     :priority "B"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Validation"
     :priority "C"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Actualization"
     :priority "D"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Reading"
     :priority "E"
     :transformer #'my-org-agenda-remove-recur)
  (:name "Refinement"
     :priority "F"
     :transformer #'my-org-agenda-remove-recur)
))
(org-super-agenda-mode)
#+end_src
*** links

#+begin_src emacs-lisp
(defun org-force-open-current-window ()
  (interactive)
  (let ((org-link-frame-setup (quote
                               ((vm . vm-visit-folder)
                                (vm-imap . vm-visit-imap-folder)
                                (gnus . gnus)
                                (file . find-file)
                                (wl . wl)))
                              ))
    (org-open-at-point)))
;; Depending on universal argument try opening link
(defun org-open-maybe (&optional arg)
  (interactive "P")
  (if arg
      (org-open-at-point)
    (org-force-open-current-window)
    )
  )

#+end_src

Prevent org mode from auto expanding relative paths.
- This is needed for Zettelkasten to be portable

#+begin_src emacs-lisp
(setq org-link-file-path-type 'relative)
#+end_src

