init.org
*** source blocks

When editing org-files with source-blocks, we want the source blocks to
be themed as they would in their native mode.

#+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 0)
#+END_SRC

This is quite an ugly fix for allowing code markup for expressions like
="this string"=, because the quotation marks causes problems.

#+BEGIN_SRC emacs-lisp
(ignore-errors (eval-after-load "org"
  '(progn
     (require 'ob-shell)
     (setcar (nthcdr 2 org-emphasis-regexp-components) " \t\n,")
     (custom-set-variables `(org-emphasis-alist ',org-emphasis-alist)))))
#+END_SRC

Make blocks more distinct

#+begin_src emacs-lisp
(setq org-fontify-quote-and-verse-blocks t)
(custom-set-faces
 '(org-block-begin-line
   ((t (:foreground "#D6D6D6" :background "#2e373b"))))
 '(org-block
   ((t (:foreground "#70acc2"))))
 '(org-block-end-line
   ((t (:foreground "#D6D6D6" :background "#2e373b"))))
 )
#+end_src

*** pdf

Org mode does currently not support synctex (which enables you to jump from
a point in your TeX-file to the corresponding point in the pdf), and it
seems like a tricky problem]].

Calling this function from an org-buffer jumps to the corresponding section
in the exported pdf (given that the pdf-file exists), using pdf-tools.

#+BEGIN_SRC emacs-lisp
(defun org-sync-pdf ()
  (interactive)
  (let ((headline (nth 4 (org-heading-components)))
        (pdf (concat (file-name-base (buffer-name)) ".pdf")))
    (when (file-exists-p pdf)
      (find-file-other-window pdf)
      (pdf-links-action-perform
       (cl-find headline (pdf-info-outline pdf)
                :key (lambda (alist) (cdr (assoc 'title alist)))
                :test 'string-equal)))))

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-'") 'org-sync-pdf))
#+END_SRC

*** babel


This allows for the execution of literate sh files.

#+BEGIN_SRC emacs-lisp
(defun sudo-shell-command (command)
  (interactive "MShell command (root): ")
  (with-temp-buffer
    (cd "/sudo::/")
    (async-shell-command command)))
(defun org-tangle-sh ()
  (interactive)
  (find-file buffer-file-name)
  (org-babel-tangle)
  (let ((script-file (concat
          (car (split-string buffer-file-name ".org")) ".sh")))
    (sudo-shell-command
      (concat "chmod +x " script-file " && " "./" script-file))
  )
)
#+END_SRC

*** export

Sometimes I want to use the same org file to export into different sources,
but not include all of the content. For example, if I'm exporting into a
presentation, I might not want to export all of the paragraphs. This is done
by adding advice to the various export commands to ignore certain tags.

#+BEGIN_SRC emacs-lisp
(defun org-ascii-set-export-options
    (orig &optional async subtreep visible-only body-only ext-plist)
  (let ((org-export-exclude-tags '("no_ascii_export")))
    (funcall orig async subtreep visible-only body-only ext-plist)))

(advice-add 'org-ascii-export-to-ascii
            :around #'org-ascii-set-export-options)

(advice-add 'org-ascii-export-as-ascii
            :around #'org-ascii-set-export-options)

(defun org-html-set-export-options
    (orig &optional async subtreep visible-only body-only ext-plist)
  (let ((org-export-exclude-tags '("no_html_export")))
    (funcall orig async subtreep visible-only body-only ext-plist)))

(advice-add 'org-html-export-to-html
            :around #'org-html-set-export-options)

(advice-add 'org-html-export-to-html-and-browse
            :around #'org-html-set-export-options)

(defun org-latex-set-export-options
    (orig &optional async subtreep visible-only body-only ext-plist)
  (let ((org-export-exclude-tags '("no_latex_export")))
    (funcall orig async subtreep visible-only body-only ext-plist)))

(advice-add 'org-latex-export-to-pdf
            :around #'org-latex-set-export-options)

(defun org-reveal-set-export-options
    (orig &optional async subtreep visible-only body-only ext-plist)
  (let ((org-export-exclude-tags '("no_reveal_export")))
    (funcall orig async subtreep visible-only body-only ext-plist)))

(advice-add 'org-reveal-export-to-html
            :around #'org-reveal-set-export-options)

(advice-add 'org-reveal-export-to-html-and-browse
            :around #'org-reveal-set-export-options)

(defun org-twbs-set-export-options
    (orig &optional async subtreep visible-only body-only ext-plist)
  (let ((org-export-exclude-tags '("no_twbs_export")))
    (funcall orig async subtreep visible-only body-only ext-plist)))

(advice-add 'org-twbs-export-to-html
            :around #'org-twbs-set-export-options)

(advice-add 'org-twbs-export-to-html-and-browse
            :around #'org-twbs-set-export-options)
#+END_SRC


This function will render the given org file as html and then insert the result into the current buffer. This is useful for embedding the contents of other org files.

#+begin_src emacs-lisp
(defun render-org-twbs (org-file)
  "Render the given org file as html using twbs."

  (interactive "f\nf")

  (unless (string= "org" (file-name-extension org-file))
    (error "INFILE must be an org file."))

  (let* ;; Check if the file is already open
        ((open (find-buffer-visiting org-file))

        ;; Load the file into a buffer
        (org-file-buffer (find-file-noselect org-file))

        ;; Switch to temp buffers to render contents of org file
        (result (with-current-buffer org-file-buffer
                  ;; Temporarily use the org-file-buffer and render
                  (org-twbs-export-as-html nil nil t t)
                  (with-current-buffer "*Org HTML Export*"
                     ;; Temporarily switch and get result of render
                     (buffer-string)))))

    (kill-buffer "*Org HTML Export*")

    ;; Don't kill the buffer if it was open previously
    (unless open (kill-buffer org-file-buffer))

    result))
#+end_src
*** latex

=.tex=-files should be associated with =latex-mode= instead of
=tex-mode=.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.tex\\'" . latex-mode))
#+END_SRC

Use ~biblatex~ for bibliography.

#+BEGIN_SRC emacs-lisp
(setq-default bibtex-dialect 'biblatex)
#+END_SRC

When exporting from org-mode to pdf via latex, use pdflatex and bibtex. Uses
an explicit bash command to allow for this to work on windows via the linux
subsystem.

#+BEGIN_SRC emacs-lisp
(setq org-highlight-latex-and-related '(latex script entities))
(setq org-latex-pdf-process
    '("bash -c \"pdflatex -interaction nonstopmode -output-directory %o %f\""
      "bash -c \"bibtex %b\""
      "bash -c \"pdflatex -interaction nonstopmode -output-directory %o %f\""
      "bash -c \"pdflatex -interaction nonstopmode -output-directory %o %f\""))
#+END_SRC
*** refile

Configures refile to file things two headers deep and use outline completion

So like =Project Backlog/Some Project/= it refile to this sub header

#+begin_src emacs-lisp
(setq org-refile-targets '((org-agenda-files :maxlevel . 2)))
(setq org-refile-use-outline-path t)
#+end_src
*** ref
#+BEGIN_SRC emacs-lisp
;; (require 'org-ref)
#+END_SRC
*** keybindings

#+BEGIN_SRC emacs-lisp
(define-key custom-bindings-map (kbd "C-c c")       'org-capture)
(define-key custom-bindings-map (kbd "C-c t")
  (lambda () (interactive) (org-agenda nil "n")))
(define-key custom-bindings-map (kbd "C-c l")       'org-store-link)
(define-key custom-bindings-map (kbd "C-c a")       'org-agenda)
;; Redefine file opening without clobbering universal argumnet
(define-key org-mode-map "\C-c\C-o" 'org-open-maybe)
#+END_SRC
