init.org
*** zettelkausten

A utility for adding tags to zettlekausten notes

#+begin_src emacs-lisp
(defun org-zettelkasten-get-file-id ()
  (let ((path (buffer-file-name)))
  (with-temp-buffer
    (insert path)
    (beginning-of-buffer)
    (while (re-search-forward
            (rx (char alpha) ":/"
                (1+ (1+ (char word)) "/")
                (group (1+ digit))
                ".org")
           nil t)
      (replace-match "\\1"))
    (buffer-string))))

(defun org-zettelkasten-pick-tag ()
  (let* ((tag-file-buffer (find-file (counsel-find-file (concat org-zettelkasten-dir "/zettl-tags/"))))
         (name (buffer-file-name tag-file-buffer)))
    (kill-buffer tag-file-buffer)
    name))

(defun org-zettelkasten-append-tag (tag-file-name buff-name link-text)
  (append-to-file (concat "[[file:../" buff-name "][" link-text "]]") nil
                  tag-file-name))

(defun first-line-of-buffer-or-name ()
  (let* ((text (split-string (buffer-substring-no-properties (point-min) (point-max)) "\n"))
         (first-line (car (delete "" text))))
    (if (string= first-line "") (buffer-name) first-line)))

(defun org-zettelkasten-buffer-name ()
  (interactive)
  (rename-buffer (first-line-of-buffer-or-name)))

(defun org-zettelkasten-add-tag-if-missing (tag-file-name title)
  (let* ((id (org-zettelkasten-get-file-id)))
  (with-temp-buffer
    (when (file-exists-p tag-file-name)
      (insert-file-contents tag-file-name))
    (when (not (re-search-forward id nil t))
      (org-zettelkasten-append-tag tag-file-name (concat id ".org") title)))))

(defun org-zettelkasten-add-tag ()
  (interactive)
  (save-window-excursion
    (org-zettelkasten-add-tag-if-missing
      (org-zettelkasten-pick-tag)
      (first-line-of-buffer-or-name))))
#+end_src

List all tags for a given note

#+begin_src emacs-lisp
(defun org-zettelkasten-list-tags ()
  (interactive)
  (lgrep (buffer-name) "*.org" (concat org-zettelkasten-dir "/zettl-tags")))
#+end_src

Add all tags currently listed in grep to the current note

#+begin_src emacs-lisp
(defun org-zettelkasten-copy-tags-from-grep ()
  (interactive)
  (mapc (lambda (tag-file-name)
          (org-zettelkasten-append-tag
           (concat org-zettelkasten-dir "/zettl-tags/" tag-file-name)
           (buffer-name)
           (first-line-of-buffer-or-name)))
    (apply #'append (with-current-buffer "*grep*"
                      (s-match-strings-all
                       (rx (and line-start (+ (or letter digit "-")) ".org"))
                       (buffer-substring-no-properties (point-min) (point-max)))))))
#+end_src

List all notes which link to this one

#+begin_src emacs-lisp
(defun org-zettelkasten-list-external-refs ()
  (interactive)
  (lgrep (file-name-nondirectory (buffer-file-name)) "*.org" (concat org-zettelkasten-dir)))
#+end_src

Search the zettelkasten using grep

#+begin_src emacs-lisp
(defun org-zettelkasten-search ()
  (interactive)
  (lgrep (read-string "query: ") "*.org" org-zettelkasten-dir))
#+end_src

Create new Zettelkasten note

#+begin_src emacs-lisp
(defun org-zettelkasten-new-note ()
  (interactive)
  (find-file (concat org-zettelkasten-dir "/"
                     (format-time-string "%d%m%Y%H%M%S" (current-time)) ".org")))

(defun org-zettelkasten-gen-id ()
  (interactive)
  (insert (format-time-string "%d%m%Y%H%M%S" (current-time))))
#+end_src

#+begin_src emacs-lisp
(defun org-zettelkasten-conversation ()
  (interactive)
  (counsel-find-file (concat org-zettelkasten-dir "/conversations/")))

(defun org-zettelkasten-conversation-branch ()
  (interactive)
  (let* ((new-note-name (concat (format-time-string "%d%m%Y%H%M%S" (current-time)) ".org"))
         (new-note-path (concat org-zettelkasten-dir "/" new-note-name))
         (new-note-desc (if (use-region-p)
                              (progn
                                (kill-region (region-beginning) (region-end))
                                (concat "][" (car kill-ring) "]]"))
                              "]]"))
         (new-note-link (concat "[[file:" (file-relative-name new-note-path default-directory) new-note-desc))
         (prev-note-title (first-line-of-buffer-or-name))
         (prev-note-link (concat "[[file:" (file-relative-name (buffer-file-name) org-zettelkasten-dir) "][" prev-note-title "]]")))
    (insert new-note-link)
    (save-buffer)
    (find-file new-note-path)
    (insert (concat (car kill-ring) "\n\nprevious:\n" prev-note-link))
    (org-zettelkasten-buffer-name)))
#+end_src

Functions for referencing notes

#+begin_src emacs-lisp
(setq org-zettelkasten-ref nil)

(defun org-zettelkasten-grab-ref ()
  (interactive)
  (setq org-zettelkasten-ref (buffer-file-name)))

(defun org-zettelkasten-use-ref ()
  (interactive)
  (let* ((link-end (if (use-region-p)
                         (progn
                            (kill-region (region-beginning) (region-end))
                            (concat "][" (car kill-ring) "]]"))
                       "]]")))
    (insert (concat "[[file:" (file-relative-name org-zettelkasten-ref default-directory) link-end)))
  )
#+end_src

A function for easy html export to blog

#+begin_src emacs-lisp
(defun org-zettelkasten-publish-to-blog ()
  (interactive)
  (let* ((input (buffer-file-name))
        (id-regex (rx (1+ (in digit)) ".org"))
        (id (substring input (string-match id-regex input) -4))
        (old-buffer (buffer-name)))
    (save-window-excursion
      (org-zettelkasten-add-tag-if-missing
       (concat org-zettelkasten-dir "/zettl-tags/blog-published.org")
       (first-line-of-buffer-or-name))
      (with-temp-buffer
        (insert-buffer-substring old-buffer)
         (beginning-of-buffer)
         (insert "#+TITLE: ")
        (org-html-export-as-html))
      (switch-to-buffer "*Org HTML Export*")
      (write-region
       (point-min) (point-max)
       (concat "d:/current-projects/blog/public/" id ".html"))
      (with-temp-buffer
        (insert-file-contents
         (concat org-zettelkasten-dir "/zettl-tags/blog-published.org"))
        (while (re-search-forward (rx "../" (group (1+ (in digit))) ".org") nil t)
          (replace-match "\\1.html"))
        (beginning-of-buffer)
        (while (re-search-forward (rx "[[") nil t)
          (replace-match "\n- [["))
        (org-html-export-as-html))
      (switch-to-buffer "*Org HTML Export*")
      (write-region
       (point-min) (point-max)
       "d:/current-projects/blog/public/index.html")
      (kill-matching-buffers "\\*Org HTML Export\\*" nil t))))
#+end_src

A hydra for quickly calling zettlekausten functions

#+begin_src emacs-lisp
(defhydra hydra-zettelkasten (:hint nil)
  "
^Notes^         ^Refs^         ^Tags^                    ^Search^
----------------------------------------------------------------------
_n_: New Note   _g_: Grab ref   _t_: Add Tag              _s_: Search
_c_: New Convo  _u_: Use Ref    _l_: List Tags            _e_: Links to this Note
_b_: Branch     ^ ^             _C_: Copy Tags from Grep  _p_: Publish to Blog
_r_: Rename Buffer
"
  ("n" org-zettelkasten-new-note)
  ("c" org-zettelkasten-conversation)
  ("b" org-zettelkasten-conversation-branch)
  ("r" org-zettelkasten-buffer-name)

  ("t" org-zettelkasten-add-tag)
  ("l" org-zettelkasten-list-tags)
  ("C" org-zettelkasten-copy-tags-from-grep)

  ("s" org-zettelkasten-search)
  ("e" org-zettelkasten-list-external-refs)

  ("g" org-zettelkasten-grab-ref)
  ("u" org-zettelkasten-use-ref)
  ("p" org-zettelkasten-publish-to-blog)
)

(global-set-key (kbd "C-c z") #'hydra-zettelkasten/body)
#+end_src

** purescript
#+BEGIN_SRC emacs-lisp
(when config-use-purescript
  (use-package purescript-mode
    :ensure t)

  (defun purescript-setup ()
    (turn-on-purescript-indentation))

  (add-hook 'purescript-mode-hook #'purescript-setup))
#+END_SRC
** prolog
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.pl\\'" . prolog-mode))
#+end_src
** python
#+BEGIN_SRC emacs-lisp :tangle (if config-use-python "yes" "no")
(use-package elpy
  :ensure t)
(use-package py-autopep8
  :ensure t)

;; Highlight character at "fill-column" position.
(add-hook 'python-mode-hook
          (lambda () (interactive)
            (set-variable 'py-indent-offset 4)
            (set-variable 'indent-tabs-mode nil)))
#+END_SRC
** php

#+begin_src emacs-lisp :tangle (if config-use-php "yes" "no")
(use-package php-mode :ensure t)
#+end_src
** javascript
#+BEGIN_SRC emacs-lisp :tangle (if config-use-javascript "yes" "no")
(use-package js2-mode :ensure t)
#+END_SRC
** nix
#+BEGIN_SRC emacs-lisp :tangle (if config-use-nix "yes" "no")
(use-package nix-mode :ensure t)
#+END_SRC
