init.org
** rust

#+BEGIN_SRC emacs-lisp
(when config-use-rust
  (use-package rust-mode
    :ensure t)
  (use-package racer
    :ensure t)
  (use-package flycheck-rust
    :ensure t)
  (use-package flycheck-rust
    :ensure t)
  (use-package cargo
    :ensure t)

  (require 'rust-mode)

  (defun rust-mode-setup ()
    (cargo-minor-mode nil)
    (flycheck-mode))

  (defun racer-mode-setup ()
    (eldoc-mode))

  (add-hook 'rust-mode-hook #'rust-mode-setup)

  (define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
  (define-key rust-mode-map (kbd "C-?") #'racer-describe)
  (setq company-tooltip-align-annotations t)

  (setq rust-format-on-save t))
#+END_SRC
** z3

#+begin_src emacs-lisp
(use-package z3-mode
  :ensure t)
#+end_src

* Finalize Settings

Lastly we need to activate the map by creating and activating the
=minor-mode=.

#+BEGIN_SRC emacs-lisp
(define-minor-mode custom-bindings-mode
  "A mode that activates custom-bindings."
  t nil custom-bindings-map)


#+END_SRC

Report some startup stats

#+begin_src emacs-lisp
(message "*** Emacs loaded in %s with %d garbage collections."
     (format "%.2f seconds"
             (float-time
              (time-subtract after-init-time before-init-time))) gcs-done)

#+end_src

The GC threshold was increased in =early-init.el= so it is restored here

#+begin_src emacs-lisp
(setq gc-cons-threshold 800000)
#+end_src
